Enterprise_Serivces/Cert/SilverGroup1/CSLAllSparkOrderService/result1/Iteration1/t3_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><CorrelationID xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0">ebab6a4d-4f04-4edb-9211-790a49e9de65</CorrelationID><MachineName xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0">test</MachineName><wsa:Action>http://www.gamestop.com/CSL/AllSparkOrder/V1.0/OrderService_v1/PrepareOrderForDelivery</wsa:Action><wsa:MessageID>uuid:3738c10e-e56a-4e29-9152-cd18be8204fb</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslallsparkorderserviceqa1.testgs.pvt/OrderService.svc</wsa:To></soap:Header><soap:Body><PrepareOrderForDeliveryRequest xmlns="http://www.gamestop.com/CSL/AllSparkOrder/V1.0"><OrderRequestGUID>fa260bbb-30c0-4124-95da-7be4e260a6d5</OrderRequestGUID><PartnerKey>TEST-US</PartnerKey></PrepareOrderForDeliveryRequest></soap:Body></soap:Envelope>